module.exports = {
  code : code(),
  map: map()
}
function code(){
 return  {
    "3": {  // 学院，专业班级
      "67": [
        "061",  // 药学18（1）
        "062",  // 药学18（2）
        "063",  // 药学18（3）
        "064",  // 药学18（4）
        "065",  // 药学(3+1本科双学位国际班)18
        "066",  // 临床药学18（1）
        "067",  // 临床药学18（2）
        "068",  // 药物分析18
        "069",  // 药物化学18
        "070",  // 药物制剂18（1）
        "071",  // 药物制剂18（2）
        "072",  // 制药工程18（1）
        "073",  // 制药工程18（2）
        "084"  // 药学(整合药学)18
      ],
     "68": [
          "074",  // 中药学18（1）
          "075",  // 中药学18（2）
          "076",  // 中药制药18（1）
          "077"  // 中药制药18（2）
        ],
     "69": [  // 生命科学与生物制药学院
            "078",  // 海洋药学18
            "079",  // 生物工程18
            "080",  // 生物技术18
            "081",  // 生物制药18（1）
            "082",  // 生物制药18（2）
            "083"  // 生物制药18（3）
          ],
     "72": [  // 公共卫生学院
              "085",  // 预防医学18（1）
              "086",  // 预防医学18（2）
              "087",  // 预防医学18（3）
              "088",  // 预防医学18（4）
              "089",  // 预防医学18（5）
              "090",  // 预防医学18（6）
              "091",  // 卫生检验与检疫18（1）
              "092"  // 卫生检验与检疫18（1）
            ],

      "73": [  // 临床医学院
                "093",  // 临床医学18（1）
                "094",  // 临床医学18（2）
                "095",  // 临床医学18（3）
                "096",  // 临床医学18（4）
                "097"  // 医学检验技术18
              ],

        "76": [  // 护理学院
                  "098",  // 护理学18（1）
                  "099",  // 护理学18（2）
                ],

         "79": [  // 医药信息工程学院
                    "100",  // 计算机科学与技术(外包特色班)18（1）
                    "101",  // 计算机科学与技术(外包特色班)18（2）
                    "102"  // 计算机科学与技术(外包特色班)18（3）
                  ],

           "82": [  // 外国语学院
                      "103",  // 英语18（1）
                      "104"  // 英语18（2）
                    ]
      }
    }
}
function map(){
  return  {
    map: { 
      "0": "校级组织",
      "2": "教学院部", 
      "00": "共青团广东药科大学学生委员会",  
      "67": "药学院", 
      "68": "中药学院",
      "69": "生命科学与生物制药学院",
      "70": "整合药学院",
      "72": "公共卫生学院",
      "73": "临床医学院",
      "75": "健康学院",
      "76": "护理学院",
      "79": "医药信息工程学院",
      "82": "外国语学院",
    
      "000": "办公室",  // 团委
      "001": "组织部",
      "002": "宣传部-宣传组",
      "003": "宣传部-运营组",
      "004": "实践部",
      "005": "科技部",
      "006": "网络中心-设计组",
      "007": "网络中心-技术组",

      "061": "药学18(1)", // 药学院
      "062": "药学18(2)",
      "063": "药学18(3)",
      "064": "药学18(4)",
      "065": "药学(3+1本双国际班)18",
      "066": "临床药学18(1)",
      "067": "临床药学18(2)",
      "068": "药物分析18",
      "069": "药物化学18",
      "070": "药物制剂18(1)",
      "071": "药物制剂18(2)",
      "072": "制药工程18(1)",
      "073": "制药工程18(2)",

      "074": "中药学18(1)",  // 中药学院
      "075": "中药学18(2)",
      "076": "中药制药18(1)",
      "077": "中药制药18(2)",

      "078": "海洋药学18",  // 生命科学与生物制药学院
      "079": "生物工程18",
      "080": "生物技术18",
      "081": "生物制药18(1)",
      "082": "生物制药18(2)",
      "083": "生物制药18(3)",

      "084": "药学(整合药学)18",  // 整合药学院(前)的划掉）药学院

      "085": "预防医学18(1)",  // 公共卫生学院
      "086": "预防医学18(2)",
      "087": "预防医学18(3)",
      "088": "预防医学18(4)",
      "089": "预防医学18(5)",
      "090": "预防医学18(6)",
      "091": "卫生检验与检疫18(1)",
      "092": "卫生检验与检疫18(1)",

      "093": "临床医学18(1)",  // 临床医学院
      "094": "临床医学18(2)",
      "095": "临床医学18(3)",
      "096": "临床医学18(4)",
      "097": "医学检验技术18",

      "098": "护理学18(1)",  // 护理学院
      "099": "护理学18(2)",

      "100": "计算机科技(外包)18(1)",  // 医药信息工程学院
      "101": "计算机科技(外包)18(2)",
      "102": "计算机科技(外包)18(3)",

      "103": "英语18(1)",  // 外国语学院
      "104": "英语18(2)"
    }
  }
}